
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.redis_access_key
* Delete
  * module.et-frontend-session-storage.azurerm_private_endpoint.this[0]
* Replace
  * module.et-frontend-session-storage.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_access_key" {
        id                      = "https://et-aat.vault.azure.net/secrets/redis-access-key/42f279648a014f7fbbcae2aee0d44e51"
        name                    = "redis-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.et-frontend-session-storage.azurerm_private_endpoint.this[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_private_endpoint" "this" {
      - custom_dns_configs       = [] -> null
      - id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-sya-session-storage-cache-aat/providers/Microsoft.Network/privateEndpoints/et-sya-session-storage-aat" -> null
      - location                 = "uksouth" -> null
      - name                     = "et-sya-session-storage-aat" -> null
      - network_interface        = [
          - {
              - id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-sya-session-storage-cache-aat/providers/Microsoft.Network/networkInterfaces/et-sya-session-storage-aat.nic.40b9637c-f894-46ff-9a11-4d519561079a"
              - name = "et-sya-session-storage-aat.nic.40b9637c-f894-46ff-9a11-4d519561079a"
            },
        ] -> null
      - private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-sya-session-storage-cache-aat/providers/Microsoft.Network/privateEndpoints/et-sya-session-storage-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "et-sya-session-storage-aat.privatelink.redis.cache.windows.net"
                      - ip_addresses = [
                          - "10.96.136.17",
                        ]
                      - name         = "et-sya-session-storage-aat"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> null
      - resource_group_name      = "et-sya-session-storage-cache-aat" -> null
      - subnet_id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-2-aat" -> null
      - tags                     = {
          - "application"         = "employment-tribunals"
          - "builtFrom"           = "https://github.com/HMCTS/et-sya-frontend.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#et-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Employment Tribunals"
        } -> null

      - private_dns_zone_group {
          - id                   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-sya-session-storage-cache-aat/providers/Microsoft.Network/privateEndpoints/et-sya-session-storage-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup" -> null
          - name                 = "redis-endpoint-dnszonegroup" -> null
          - private_dns_zone_ids = [
              - "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ] -> null
        }

      - private_service_connection {
          - is_manual_connection           = false -> null
          - name                           = "et-sya-session-storage-aat" -> null
          - private_connection_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-sya-session-storage-cache-aat/providers/Microsoft.Cache/redis/et-sya-session-storage-aat" -> null
          - private_ip_address             = "10.96.136.17" -> null
          - subresource_names              = [
              - "redisCache",
            ] -> null
        }
    }

  # module.et-frontend-session-storage.azurerm_redis_cache.redis must be replaced
-/+ resource "azurerm_redis_cache" "redis" {
      ~ hostname                      = "et-sya-session-storage-aat.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-sya-session-storage-cache-aat/providers/Microsoft.Cache/redis/et-sya-session-storage-aat" -> (known after apply)
        name                          = "et-sya-session-storage-aat"
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ public_network_access_enabled = false -> true
      ~ redis_version                 = "6.0" -> "4"
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ ssl_port                      = 6380 -> (known after apply)
      + subnet_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-1-aat" # forces replacement
        tags                          = {
            "application"         = "employment-tribunals"
            "builtFrom"           = "https://github.com/HMCTS/et-sya-frontend.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#et-tech"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals"
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (7 unchanged attributes hidden)

      ~ redis_configuration {
          - aof_backup_enabled              = false -> null
          ~ maxclients                      = 7500 -> (known after apply)
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
            # (5 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":938,"Program":"tfcmt","SHA1":"","Vars":{}} -->